{"appid":1964480,"newsitems":[{"gid":"1794102528147158","title":"YAMI Editor Concluding Update & Open Source","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1794102528147158","is_external_url":true,"author":"yami","contents":"[h2]🚀 Rewrite JavaScript Game Scripts to TypeScript[/h2]\n[list]\n[*] TypeScript can detect syntax errors in advance, making it easier for AI to assist in writing plugin scripts.\n[*] Once a code error is detected, you can have the AI fix it until no errors remain.\n[*] After updating, you must wait for TypeScript compilation to complete before entering the game; otherwise, you’ll encounter a black screen.\n[/list]\n\n[h2]🌐 Editor Localization Updates[/h2]\n[list]\n[*] Added a Russian language pack, translated and provided by Steam community members ZerosmO / SmoLife — huge thanks!\n[*] Used ChatGPT to translate English tooltips.\n[/list]\n\n[h2]⚙️ Project Settings Adjustments[/h2]\n\n[h3]🎮 Virtual Axis Keys[/h3]\n[list]\n[*] [b]Added 4 virtual axis keys[/b] (default bindings: W, S, A, D).\n[*] You can retrieve \"Virtual Axis X/Y/Angle\" via the \"Set Number\" command to simplify up, down, left, and right movement logic.\n[/list]\n\n[h3]⚡ WebGL Low Latency Mode[/h3]\n[list]\n[*] [b]Reduces rendering latency after user input[/b], enhancing the operational experience.\n[/list]\n\n[h3]🔄 Auto Compile[/h3]\n[list]\n[*] [b]Option to enable the editor’s built-in TypeScript compilation feature[/b].\n[*] Compilation info and error reports can be viewed in the bottom left corner.\n[*] If VS Code is installed, clicking the script path takes you directly to the error location.\n[/list]\n\n[h3]💾 Save Location Options[/h3]\n[list]\n[*] [b]User Data Directory[/b]: Saves are stored in the system application data directory, hidden from users.\n[*] [b]User Documents Directory[/b]: Saves are stored in the \"Documents\" folder.\n[*] [b]Application Local Directory[/b]: Saves are stored in the app’s local directory, which may be overwritten during updates.\n[/list]\n\n[h3]⚠️ Removed Some Features[/h3]\n[list]\n[*] [b]Removed[/b] \"Initial Player Actor\", \"Initial Party Members\", and \"Party Inventory Mode\".\n[*] These settings are no longer necessary; repair methods will be provided later.\n[*] [b]Removed[/b] \"Special Events\" and automatically converted them to the following event types:\n[*] Startup\n[*] Load Save\n[*] Create Scene\n[*] Show Text\n[*] Show Choices\n[/list]\n\n[h2]🛠 Editor Changes[/h2]\n[list]\n[*] [b]Selected Object -> Right-Click Menu -> Find References[/b]: Search for where the target object is referenced.\nObjects that can be checked: scene objects, elements, global variables, attributes enumerations, localized text, and any files.\n[*] Deleting a single file now automatically checks if it’s referenced and issues a warning.\n[*] [b]Project Directory -> Right-Click Menu -> Find Invalid References[/b]: Lists all paths where referenced objects were accidentally deleted, boosting security for OCD users.\n[*] [b]Project Directory -> Right-Click Menu -> Find Unused References[/b]: Lists unused objects outside of scene objects and UI elements, including global variables, attributes, enumerations, localized text, and any files.\n[*] [b]Project Directory -> Right-Click Menu -> Create -> Script[/b]:\nAdded multiple script template files.\nProvided a simple combat state machine example.\nRecommended installing the VS Code Tabnine extension (an AI-powered code completion tool).\n[*] Expanded the \"Search Box\" to allow finding objects or files by GUID.\n[*] Added a left sidebar in the event editor to quickly locate all events related to the selected event.\n[*] In the event editor’s command list, the \"Call Event\" command line can now quickly open the called global event.\n[*] Command list item indentation in the event editor has been doubled.\n[*] Object events can be toggled individually (shortcut: /) for debugging.\n[*] Added a \"Duplicate\" option (shortcut: Ctrl+D) to the \"Right-Click Menu\" for scene objects and UI elements, enabling quick copying to the same level.\n[*] Added a \"Reset Start Position\" option to the scene menu to cancel the selected initial position marker.\n[*] Disabled objects in the scene are now displayed as semi-transparent.\n[/list]\n\n[h2]🖥️ MacOS Related Optimizations[/h2]\n[list]\n[*] [b]Added \"MacOS Universal\" deployment option[/b]: Supports both Intel x64 and Apple arm64 CPUs, with a slight increase in file size.\n[*] Adjusted the MacOS editor app icon size to 85%, which may require deleting and reinstalling the app.\n[/list]\n\n[h2]📝 Auto-Generate Global Variable {Name->ID} Table[/h2]\n[list]\n[*] Automatically generates a {Name->ID} mapping table for global variables and saves it to the Script/yami.ts file.\n[/list]\n\n[h2]🎭 Actor System Optimizations[/h2]\n[list]\n[*] Added an [b]\"Immovable\"[/b] property to actors.\n[*] When enabled, the actor won’t be pushed by other actors during collisions.\n[*] Collision relationships must be configured in the [b]\"Team\"[/b] window to trigger collision effects.\n[/list]\n\n[h2]📜 Object Inheritance Feature[/h2]\n[list]\n[*] Supported inherited objects: actors, skills, triggers, states, items, and equipment.\n[*] After inheriting an object, repetitive settings can be skipped; child objects automatically inherit the parent’s attributes, events, and scripts.\n[*] If events of the same type exist, the child overrides the parent’s event and can call the overridden parent event via the [b]\"Call Event\"[/b] command.\n[*] When inheriting the same script, it overrides the parent’s script.\n[*] When inheriting attributes with the same key name, the child overrides the parent’s attribute value.\n[/list]\n\n[h2]📦 New Element Prefab[/h2]\n[list]\n[*] Added a [b]\"Reference\"[/b] element, which can point to an existing element and replicate it.\n[*] Modifying the referenced element updates all reference elements synchronously, eliminating the need to edit multiple instances manually.\n[*] [b]Element Menu -> Create -> Reference[/b]: Inserts an empty reference element.\n[*] [b]Element Menu -> Create -> Shortcut[/b]: Inserts a reference element pointing to the currently selected element.\n[*] [b]Element Menu -> Set as Prefab[/b]: Designates the selected element as a prefab.\n[*] [b]Element Menu -> Create -> Prefab -> Your Added Element[/b]: Inserts the added prefab reference element.\n[*] Prefabs are ideal for storing commonly used elements and invoking them via references to improve efficiency.\n[*] Note: Reference elements are automatically replaced with the actual referenced elements during game runtime.\n[/list]\n\n[h2]✨ Particle Sprite Display Optimization[/h2]\n[list]\n[*] Particle sprites can now use [b]animation sequence frames[/b] for playback.\n[*] In older projects, particle sprites default to [b]random sprite frames[/b] to maintain compatibility.\n[/list]\n\n[h2]🎭 New Actor Animation Directions[/h2]\n[list]\n[*] Added [b]\"Bottom Right, Top Right\"[/b] directions to actor animations, which can mirror [b]\"Bottom Left, Top Left\"[/b].\n[/list]\n\n[h2]🌍 Support Placing Global Actors in Scenes[/h2]\n[list]\n[*] Placing a global actor in a scene will attempt to create that actor.\n[*] If the global actor already exists, it will only be teleported to the specified position.\n[*] Events of global actors in a scene are unloaded when leaving the scene, and running events will stop.\n[*] When a global actor enters a new scene, it loads the scene’s events and immediately executes any \"Autorun\" events (if present).\n[/list]\n\n[h2]🔄 Event Type Changes[/h2]\n[list]\n[*] [b]Removed[/b] the following global event types:\n[*] Add Skill\n[*] Remove Skill\n[*] Add State\n[*] Remove State\n[*] Add Equipment\n[*] Remove Equipment\n[*] [b]Added[/b] the following global event types:\n[*] Startup\n[*] Create Scene\n[*] Load Scene\n[*] Load Save\n[*] Show Text\n[*] Show Choices\n[*] [b]Added multi-touch events[/b]: Touch Start, Touch Move, Touch End; related touch points can be retrieved via the \"For Each\" command.\n[*] [b]Added \"Destroy\" event for all scene objects[/b]: Triggered before an object is deleted.\n[*] [b]Added mouse-related events for actors[/b]: Mouse Down, Mouse Up, Mouse Enter, Mouse Move, Mouse Leave, Click, Double Click; suitable for actor (building) placement.\n[*] [b]Optimized mouse event implementation[/b]: Now compatible with single-touch events on mobile devices.\n[/list]\n\n[h2]🌐 Global Event Changes[/h2]\n[list]\n[*] [b]Added property: Namespace[/b] — Ensures an independent local variable space when called, avoiding variable sharing with the caller.\n[*] [b]Added property: Return Type[/b] — Supports boolean, number, string, object, actor, element, etc.\n[*] [b]Added property: Description[/b] — If set, a tooltip appears in the command line calling this event.\n[*] [b]Added property: Event Parameter List[/b] — Allows passing parameters when calling the event.\n[*] You can pass variables or data to global events via the \"Call Event\" command.\n[*] Global events automatically set these parameters as local variables at runtime.\n[*] You can output a return value to the caller event via the \"Return\" command and store it in a local variable.\n[/list]\n\n[h3]🎭 Preset Event Optimizations[/h3]\n[list]\n[*] Slightly simplified preset events in new projects.\n[/list]\n\n[h2]🛠 Event Command Changes[/h2]\n\n[h3]📌 Extended \"Call Event\" Command[/h3]\n[list]\n[*] [b]Call Global Event[/b] — Supports passing parameters and receiving return values, simplifying event command encapsulation.\n[*] [b]Call Inherited Event[/b] — Calls the overridden event of the same type in the inherited object, enabling extension of parent event functionality. For example:\n[*] When an actor equips or unequips equipment, first call the parent object’s event to adjust attributes.\n[*] Then add extra commands for unique functionality (e.g., adding/removing states).\n[/list]\n\n[h3]🔙 Added \"Return\" Command[/h3]\n[list]\n[*] Stops the current event from running.\n[*] If it’s a global event, it can pass a return value to the parent event that called it.\n[/list]\n\n[h3]⏹️ Extended \"Stop Event\" Command[/h3]\n[list]\n[*] Now allows stopping events of specified objects, e.g.:\n[*] Stop specific event types running for a designated actor.\n[*] Differences between \"Return\" and \"Stop Event\":\n[*] [b]\"Return\"[/b] — Stops only the current event, leaving the calling parent event unaffected.\n[*] [b]\"Stop Event\"[/b] — Stops all parent events in the call chain.\n[/list]\n\n[h3]📝 Added \"Register Event\" Command[/h3]\n[list]\n[*] [b]Register and Unregister Events[/b]: Register global, actor, or element events at runtime, simplifying management and local variable sharing.\n[*] Example: For drag functionality, register mouse down, move, and up events to share local variables and streamline interaction logic.\n[*] Note: Repeatedly triggering \"Register Event\" won’t re-register the same event.\n[/list]\n\n[h3]🛠️ Added \"Create Object\" and \"Delete Object\" Commands[/h3]\n[list]\n[*] [b]Replaced \"Create Light\" and \"Delete Light\" Commands[/b]: Scene objects can now be used as prefabs for easier management and dynamic creation.\n[/list]\n\n[h3]🎬 Added \"Set Object Animation\" Command[/h3]\n[list]\n[*] [b]Modify Visual Effect Properties[/b]: Adjust hue, opacity, offset, rotation, for specified actors, triggers, and scene animations.\n[/list]\n\n[h3]🔲 Added \"Render Outline\" Command[/h3]\n[list]\n[*] [b]Actor Outline[/b]: Add outlines to one or more actors to enhance interactive visual feedback.\n[/list]\n\n[h3]📸 Added \"Clamp Camera\" and \"Unclamp Camera\" Commands[/h3]\n[list]\n[*] [b]Restrict Camera View[/b]: Limits the camera position to show only part of an area (e.g., Roguelike rooms or dungeons in War3 custom maps) when an actor enters it.\n[*] [b]Release View Restriction[/b]: Removes the restriction when no longer needed.\n[/list]\n\n[h3]🔲 Added \"Block\" Command[/h3]\n[list]\n[*] [b]Command Folding Management[/b]: Group multiple commands into a collapsible block for easier viewing and editing, improving readability and organization.\n[/list]\n\n[h3]🎯 Added \"Set Target\" Command[/h3]\n[list]\n[*] [b]Set Target Actor[/b]: Designate a specified actor as the target for subsequent operations.\n[/list]\n\n[h3]⚡ Modified \"Cast Skill\" Command[/h3]\n[list]\n[*] [b]Inherit Target Actor[/b]: When casting a skill, inherit the target actor from the current event’s actor accessor, enabling skill casting on the target.\n[/list]\n\n[h3]🎯 Modified \"Create Trigger\" Command[/h3]\n[list]\n[*] [b]Inherit Target Actor[/b]: The trigger event inherits the target actor from the current event’s accessor, supporting features like single-target tracking missiles.\n[/list]\n\n[h3]📜 Modified \"Load Scene\" Command[/h3]\n[list]\n[*] [b]Teleport Actor in Advance[/b]: When loading a scene, teleport the actor to the specified position before the \"Create Scene\" and \"Autorun\" events.\n[/list]\n\n[h3]🖱️ Extended \"If\" Command[/h3]\n[list]\n[*] [b]Added \"Just Pressed\" and \"Just Released\" Condition Judgments for Mouse/Keyboard/Controller[/b]: \"Just Pressed\"/\"Just Released\" now indicate instantaneous frame behavior.\n[/list]\n\n[h3]👣 Extended \"Follow Actor\" Command[/h3]\n[list]\n[*] [b]Added Buffer Distance[/b]: Set a buffer distance during actor following to reduce start-stop frequency and improve smoothness.\n[/list]\n\n[h3]🔒 Added Plugin \"Developer Tools Password\"[/h3]\n[list]\n[*] [b]Console Interface[/b]: After deployment, enter a password to open the console, aiding developers in viewing error messages.\n[/list]\n\n[h3]🔮 Added Custom Command \"Blurriness\"[/h3]\n[list]\n[*] [b]Blur Filter[/b]: Apply a blur effect to the scene, ideal for use when opening specific interfaces.\n[/list]\n\n[h2]🛠 Feature Modifications and Optimizations[/h2]\n\n[h3]🎧 Attenuation Sound Effect Playback Behavior Optimization[/h3]\n[list]\n[*] Modified \"Attenuation Sound Effects\" playback to calculate distance changes in real-time and dynamically adjust volume.\n[/list]\n\n[h3]⚙️ File Writing Logic Optimization[/h3]\n[list]\n[*] Moved file-writing logic from the window thread to the main thread, improving reliability of auto-saving global variables on game exit and preventing write failures from rapid window closure.\n[/list]\n\n[h3]🔧 Enhanced Error Capture[/h3]\n[list]\n[*] Previously captured only synchronous errors; now asynchronous errors are also captured and reported, boosting development efficiency.\n[/list]\n\n[h3]🐞 Fixed Known BUGs[/h3]\n[list]\n[*] Fixed multiple known bugs in the editor and game, including black screen issues on some Android systems.\n[/list]\n\n[h2]❤️ Acknowledgments Update[/h2]\n[list]\n[*] Updated the acknowledgments list to include those who provided unpaid help for the editor. Sincere thanks for your selfless contributions! Apologies for any omissions, and thank you again!\n[/list]\n\n[h2]💃 How to Utilize Actors?[/h2]\n[list]\n[*] Actors can now serve as general-purpose objects, applicable in these scenarios:\n[*] Buildings, plants, minerals, loot, chests, traps, etc.\n[*] The larger the scene, the better the optimization, enabling the placement of more actors.\n[*] If collision handling isn’t needed, set the actor’s weight to 0 for further performance gains.\n[/list]\n\n[h3]🌱 Examples of Plants, Buildings, and Loot[/h3]\n[list]\n[*] [b]Buildings[/b] as actors: Click to pop up a UI for producing soldiers or buying items.\n[*] [b]Plants[/b] as actors: Start a timer from birth, changing animation and maturity at set intervals.\n[*] [b]Loot[/b] as actors: Detect player proximity to acquire items from their inventory.\n[*] [b]Chests[/b] as actors: Click to move the player over and acquire inventory items.\n[/list]\n\n[h3]🔨 Examples of Traps and Minerals[/h3]\n[list]\n[*] [b]Traps[/b] as actors: Periodically cast range skills and auto-execute behaviors.\n[*] [b]Minerals[/b] as actors: Reduce resource attributes when mined by workers, disappearing when depleted.\n[*] Skills aren’t just for combat—they can also be used for building, resource gathering, etc.\n[/list]\n\n[h2]⚠️ Breaking Changes Explanation[/h2]\n\n[h3]🔧 Modified Plugin/Custom Command Parameter Declaration[/h3]\n[list]\n[*] @variable-getter changed to @variable-setter.\n[*] This will cause errors in scripts using @variable-getter; replace it with @variable-setter to fix.\n[*] Now, @variable-getter directly returns the value read from the specified variable, aligning with other getters.\n[/list]\n\n[h3]📁 Modified Script File Names[/h3]\n[list]\n[*] file.js → loader.ts\n[*] controller.js → input.ts\n[*] Added flow.ts (asynchronous script base class; see usage in script examples).\n[*] Added yami.ts (auto-generated global variable ID table).\n[/list]\n\n[h3]🔤 Variable Naming Adjustments[/h3]\n[list]\n[*] Event → CurrentEvent\n[*] File → Loader\n[*] EasingMap.map() → get()\n[*] Easing.scale → EasingMap.scale\n[*] Animation → AnimationPlayer\n[*] Scene.parallaxes → Scene.parallax\n[*] Scene.actors → Scene.actor / Scene.actor.list\n[*] Scene.animations → Scene.animation / Scene.animation.list\n[*] Scene.triggers → Scene.trigger / Scene.trigger.list\n[*] Scene.regions → Scene.region / Scene.region.list\n[*] Scene.lights → Scene.light\n[*] Scene.emitters → Scene.emitter / Scene.emitter.list\n[*] Scene.idMap → Scene.entity.presetIdMap\n[*] Scene.terrains.get(x, y) → Scene.terrain.get(x, y, 0)\n[*] Scene.terrains.set() → Scene.terrain.set()\n[*] Scene.terrains → Scene.terrain.rawArray\n[*] Scene.terrainObstacles.get(x, y) → Scene.terrain.get(x, y)\n[*] Scene.terrainObstacles → Scene.terrain.compositeArray\n[*] Scene.obstacles.get() → Scene.obstacle.get()\n[*] Scene.actors.cells → Scene.actor.partition\n[*] scene.updateTerrainObstacle() → scene.updateTerrain()\n[*] scene.loadTerrainObstacles() → scene.loadTerrains()\n[*] Scene.paused → Game.pauseCount\n[*] Scene.pause() → Game.pause()\n[*] Scene.continue() → Game.continue()\n[*] actor.skillManager → actor.skill\n[*] actor.stateManager → actor.state\n[*] actor.equipmentManager → actor.equipment\n[*] actor.cooldownManager → actor.cooldown\n[*] actor.shortcutManager → actor.shortcut\n[*] actor.targetManager → actor.target\n[*] texture.fromImage() → texture.loadImage()\n[*] ......\n[/list]\n\n[h3]💾 Local Save Path Changes After Deployment[/h3]\n[list]\n[*] After deployment, the resource folder has changed from the old version’s “Output Directory/” to “Output Directory/resources/app/”.\n[*] This causes a change in the local save path. Released games must update and test the (cloud) save path accordingly.\n[/list]\n\n[h3]🎮 Removed Project Settings: Initial Player Actor, Initial Party Members[/h3]\n[list]\n[*] Old projects will lose their initial actors; it’s no longer auto-created.\n[*] Use these commands in the \"Startup\" event to create the initial actors:\n[*] \"Create Global Actor\"\n[*] \"Set Player Actor\"\n[*] \"Set Party Member\"\n[/list]\n\n[h3]💼 Removed Project Settings: Party Inventory Mode[/h3]\n[list]\n[*] For traditional RPGs previously using \"Share Player’s Inventory\" in \"Party Inventory Mode\":\n[*] Call \"Set Inventory\" when an actor joins the party to share the player’s inventory.\n[*] Call \"Set Inventory\" when they leave to restore their independent inventory.\n[/list]\n\n[h3]📝 Modified Element Accessor -> Definition of \"Latest Element\"[/h3]\n[list]\n[*] Now, \"Latest Element\" points to the element directly created via the \"Create Element\" command, excluding descendants.\n[*] Previously, it pointed to a descendant, making the option hard to use effectively.\n[/list]\n\n[h3]❌ Removed: Add Skill, Remove Skill, Add State, Remove State, Add Equipment, Remove Equipment Events[/h3]\n[list]\n[*] Create common skills, states, and equipment, and let other objects inherit their add/remove events.\n[/list]\n\n[h3]🔍 How to Find and Modify Embedded Scripts in Events[/h3]  \n[list]  \n[*] Use VS Code to globally search for \"script\": in the project folder to locate embedded scripts.  \n[*] The \"Event\" variable name conflicted with the built-in \"Event\" variable in the TypeScript environment and has been renamed to \"CurrentEvent\".  \n[/list]  \n\n[h3]🔍 \"Create Light\" Command Changed to \"Create Object\" Command[/h3]\n[list]\n[*] Use VS Code to globally search for \"id\": \"createLight\" and replace with \"id\": \"createObject\".\n[/list]\n\n[h3]🔍 \"Delete Light\" Command Changed to \"Delete Object\" Command[/h3]\n[list]\n[*] Use VS Code to globally search for \"id\": \"deleteLight\", replace with \"id\": \"deleteObject\", and update \"light\" to \"object\" in the next line.\n[/list]\n\n[h3]🗂️ In the Object Script List, Scripts from the Same File Are Now Overridden Instead of Stacked[/h3]\n[list]\n[*] Only the last script from the same file is retained; duplicate the file if you need multiple identical scripts.\n[/list]\n\n[h3]🍏 Old MacOS Projects Missing Icon/icon.png, Causing Deployment Failure[/h3]\n[list]\n[*] Solution: Create a new project and copy icon.png over.\n[/list]\n\n[h3]⚙️ Some Custom Commands in Old Projects Not Updated to Latest Version, May Require More Fixes[/h3]\n[list]\n[*] Create a new project, copy changed custom commands, and use \"Find References\" to modify them yourself.\n[/list]\n\n[h2]Closing Remarks[/h2]\n\nThe editor project is officially complete. I sincerely apologize for any disruption this breaking update may have caused.\n\nTo ensure stability, no major changes will be made moving forward, but I’ll continue fixing reported bugs. I rarely check Steam community comments, so please email me directly about bugs. Thank you for your support!\n\nFor feature extensions, refer to existing plugins and use AI to create your own.\n\nGame development is a long, challenging journey:\n\nSome aim to become professional developers, dedicating immense time and energy to their craft.\nOthers seek a simple, easy-to-use engine for specific needs without deep exploration.\nSome try out of curiosity and quietly give up.\nFew who attempt game-making finish their first project; fewer still profit from it. The ideal is for work to yield commercial returns, sparking motivation for the next creation.\n\nThe YAMI editor isn’t for everyone—it meets some developers’ needs but can’t serve all. I regret this limitation. It’s best for those with some experience, suited to small-to-medium projects, like a stepping stone to professional engines. Many great engines exist; if YAMI doesn’t fit, choose what suits you best.\n\nThough not widely used or promoted, some have spent months crafting small games with it. Here are a few examples:\n[list]\n[*] Da Kui: quickly done but somewhat rough —— Journey to the West Survivor 🤣\n[*] Yahzj: A mini hit in card-based tower defense —— Border Pioneer 👈\n[*] Panda: A promising newcomer, cheer them on —— To hell with work 💪\n[/list]\nGame links are at the end—I believe everyone will keep improving!\nNext, I’ll pursue my dream game—a long-term project that may take my lifetime. For a higher technical ceiling, I’m switching to a professional engine to build a more complex architecture.\n\nAfter 8 years, YAMI enters a stable phase. New features can’t alter its core or solve \"some can’t make games,\" and might add instability. I’m tired after so long on this editor. Now, I want to learn new tech, try fresh projects, and chase freedom and passion!\n\nI’ve lowered the editor’s price to reduce trial costs. This may upset early supporters, but I’m doubly grateful for your backing XD!\n\nTrying may not succeed, but if someone’s inspired or benefits, it’s worthwhile. I’ve open-sourced the editor, games created with the editor compiled from the source code grant their authors the same rights as those created with the Steam version, with no extra legal obligations.\n\n🔗 Open Source Address:\n\nhttps://github.com/yami-pro/yami-rpg-editor\n\n\n[h3]Wishing everyone success in realizing their game dreams! 🎮✨[/h3]\n\nhttps://store.steampowered.com/app/2450100/\nhttps://store.steampowered.com/app/2346410/\nhttps://store.steampowered.com/app/3278480/","feedlabel":"Community Announcements","date":1742062342,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["mod_reviewed","ModAct_1278681683_1742062545_0","ModAct_1278681683_1742067218_4","ModAct_1278681683_1742070288_4","ModAct_1278681683_1742071999_4","ModAct_1278681683_1742073819_4","ModAct_871423085_1742076709_4","ModAct_871423085_1742081541_4","ModAct_871423085_1742101070_4","ModAct_871423085_1742103815_4","ModAct_1425979202_1742106673_4","ModAct_1425979202_1742111859_4","ModAct_1425979202_1742112207_4","ModAct_1425979202_1742112911_4","ModAct_1434278705_1742115775_4","ModAct_1294976491_1742154984_4","ModAct_1415727794_1742165313_4","ModAct_1415727794_1742176800_4","ModAct_1691520782_1742176840_4","ModAct_1415727794_1742186214_4","ModAct_1415727794_1742190252_4","ModAct_1434411615_1742195156_4","ModAct_1301790999_1742235506_4","ModAct_1301790999_1742241531_4","ModAct_1301790999_1742244232_4","ModAct_871423085_1742264002_4","ModAct_871423085_1742266729_4","ModAct_1278681683_1742320976_4","mod_require_rereview"]},{"gid":"5151601211226866047","title":"6/1 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5151601211226866047","is_external_url":true,"author":"yami","contents":"[h3]macOS version has been released[/h3]\n● Beta version, there may be some problems\n\n[h3]Performance optimization[/h3]\n● Improved actor collision performance, more actors in a scene\n\n[h3]New project - Plugin[/h3]\n● Steamworks API\n- Integrated with the STEAM game platform API, including:\n- Achievement system, get user's software and DLC purchase status, anti-piracy features...\n\n[h3]New project - Custom Commands[/h3]\n● Steamworks API\n- Activate Achievement\n- Clear Achievement\n- Is Achievement Activated\n- Is App Installed\n- Is Dlc Installed\n● Set Display Mode\n- Windowed\n- Maximized\n- Fullscreen\n\n[h3]New features[/h3]\n● Window -> Team\n- Collision between teams can be switched on and off\n- Actors in the same team can be set to hostile relationship\n● Deleted: Project Settings -> Collision System -> Ignore collision between actors in the same team\n● New event for state: Autorun\n- Triggered when adding state and load savedata\n● The state created in skill or trigger event can access the caster\n\n[h3]New commands[/h3]\n● Event command: Interface -> Set Animation (Element)\n\n[h3]Adjustments[/h3]\n● Event command: Variable -> Set Number -> Math -> Cos / Sin / Tan\n- The passed parameter has been changed from radian to degree\n\n[h3]New editor language pack[/h3]\n● Portuguese - Brazil (partial)\n- Credit to editor user Core32(@DavisCorsac), thank you so much!","feedlabel":"Community Announcements","date":1685643868,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5133583642649173052","title":"4/27 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5133583642649173052","is_external_url":true,"author":"yami","contents":"[h3]New features[/h3]\n\n● New command: Load Subscene\n- Dynamically load multiple sub-scenes into the main scene, allowing random combinations.\n\n● New command: Unload Subscene\n- Unload all objects related to the specified sub-scene from the main scene.\n\n● Add \"Pointer Events\" property to all elements\n- Enabled: trigger pointer events for this element normally\n- Disabled: disable triggering pointer events for this and descendant elements\n- Skipped: disable triggering pointer events for this element and allow triggering pointer events for descendant elements\n\n● New tag: Dynamic global variable\n- Automatically update the text content when the variable changes\n\n● Text and button elements can use <global variable> and <dynamic global variable> tags\n\n● Command upgrade: <Show Choices> can use variable tags\n\n● Command upgrade: Set Number -> Object -> Tilemap - Width/Height (new properties)","feedlabel":"Community Announcements","date":1682555212,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5133583642647545627","title":"4/26 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5133583642647545627","is_external_url":true,"author":"yami","contents":"[h3]New features[/h3]\n● Tiles can be set terrain obstacles\n● New command: Scene -> Set Tile\n● New command: Scene -> Delete Tile\n\n[h3]Adjustments[/h3]\nActor collision size limit increased to 16\nActor scaling factor no longer affects collision size","feedlabel":"Community Announcements","date":1682516646,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5133583099801915195","title":"4/22 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5133583099801915195","is_external_url":true,"author":"yami","contents":"[h3]New feature - Localization[/h3]\n● Added Project Settings (F1) -> Localization: Languages, Default Game Language\n● Added \"Localization\" window (F8): for managing language packs\n● Added \"File\" menu -> Export language pack, Import language pack: for translation\n● Localized texts can be inserted into some elements and commands via \"Right-click Menu -> Tag -> Localization\", such as:\n- Text Element\n- DialogBox Element\n- Button Element\n- Show Text\n- Show Choices\n- Set String (Template String)\n- Set Text (Content)\n- Set Dialog (Content)\n- Set Button (Content)\n\n[h3]Adjustments[/h3]\n● Optimized text rendering effect\n● Removed Project Settings -> Text -> Pixelated Rendering\n● Added Scene Object Menu -> Copy ID\n● Added Asset File Menu -> Copy ID\n\n[h3]Event command changes[/h3]\n● New Command: System -> Set Language\n● Variable -> Set Strings -> Other -> Game Language: New option\n● Skill -> Create Trigger -> \"Trigger\" property: A string variable can be used to specify the file ID","feedlabel":"Community Announcements","date":1682149690,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"6539831443777361771","title":"4/13 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6539831443777361771","is_external_url":true,"author":"yami","contents":"[h3]New feature[/h3]\n● Encrypt image files when deploying projects\n\n[h3]Adjustment[/h3]\n● Disable opening \"Developer Tools\" via F12 in the local game window after deployment\n\n[h3]Fix Bugs[/h3]\n● The UI scaling factor of the recently opened editor was not restored after restarting\n● Event command: Move Actor -> Navigate - bypass actors, bypassed actors with no collision (weight=0)","feedlabel":"Community Announcements","date":1681370759,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5121196841305949440","title":"4/11 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5121196841305949440","is_external_url":true,"author":"yami","contents":"[h3]New Features[/h3]\n● New actor property: Actor Panel -> Collision Shape\n- Square: can be used for player actors, buildings\n- Circle: can be used for monsters, a large number of such actors moving at the same time are not easily blocked.\n\n● New option: Project Settings -> Collision System -> Trigger Collision Mode\n1. Collide with actor's shape: realize the collision detection of the trigger and the large-sized actor\n2. Collide with actor's anchor: better performance\n\n● Upgrade the \"Trigger Shape Renderer\" plugin to display actor collision shapes. (F3)\n\n[h3]Command Changes[/h3]\n● Actor -> Discard Targets: \"Distance\" can use a variable\n● Actor -> Move Actor -> Navigate / Navigate - Bypass Actors, automatically refresh movement path every 500ms\n\n[h3]Fix Bugs[/h3]\n● Shared global variables could not be saved when \"Save\" folder did not exist.\n● The opacity of the animation element was not effective.\n● Animation element cannot be hidden in the editor.","feedlabel":"Community Announcements","date":1681201999,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5125698536878027721","title":"3/22 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5125698536878027721","is_external_url":true,"author":"yami","contents":"[h3]New <Button> and <Animation> elements[/h3]\n● Upgrade UI of template projects: replace some elements with buttons, support keyboard and gamepad input\n● Animation: add \"anchor\" and \"pivot\" properties to sprite frames\n\n[h3]New events[/h3]\n● Global -> Autorun\n● Global -> Gamepad Press\n● Global -> Gamepad Release\n● Global -> Left Stick Change\n● Global -> Right Stick Change\n● Element -> Create: Takes precedence over aoturun event triggering\n● Element -> Key Down: Can be triggered when set as the focus element\n● Element -> Key Up: Can be triggered when set as the focus element\n● Element -> Select Button: Triggered when the mouse enters the button\n● Element -> Deselect Button: Triggered when the mouse leaves the button\n● Element -> Gamepad Press: Can be triggered when set as the focus element\n● Element -> Gamepad Release: Can be triggered when set as the focus element\n● Element -> Left Stick Change: Can be triggered when set as the focus element\n● Element -> Right Stick Change: Can be triggered when set as the focus element\n\n[h3]New event commands[/h3]\n● Element -> Set Focus\n- Setting an element as the focus element allows you to control its child buttons with hotkeys and trigger keyboard/gamepad events for the element\n● Element -> Set Button\n- Sets the properties of the button element\n● Element -> Control Button\n- Select the specified button, or change the display style of the button\n● Element -> Set Window\n- Set the grid properties of the window element\n● System -> Simulate Key\n- Simulate the specified key and trigger the corresponding keyboard event, which can be used as the Gamepad -> Keyboard Mapping function\n\n[h3]Event command changes[/h3]\n● Variable -> Set Number\n- Element - X: the actual position X of the element\n- Element - Y: the actual position Y of the element\n- Element - Width: the actual width of the element\n- Element - Height: the actual height of the element\n- Element - Index of the selected button\n- Other - Event gamepad button\n- Other - Gamepad left stick angle: -1 or 0~360\n- Other - Gamepad right stick angle: -1 or 0~360\n● Flow -> If\n- Gamepad - Button, State\n● Flow -> Switch\n- Gamepad - Button\n● Actor -> Detect Targets\n- Distance, can use a variable\n● Element Getter, add 3 types of element fetching\n- By focus and button index\n- Get selected button in focus\n- Get the latest focus element\n\n[h3]Fix bugs[/h3]\n● Imported fonts cannot be used after deployment.\n● When pausing the game, the highest priority event could not continue after executing the wait command\n● Independently executed commands in element events were paused when pausing the game\n● Setting the actor position may report an error if the coordinates are outside the scene\n● When the scene animation is off-screen, the particles in the animation stay at a fixed position and do not follow the animation\n● The element ID input box in the \"ancestor element\" window is always displayed in the editor.\n● Element positions are calculated incorrectly when multiple window elements are nested\n● Error when getting items in the actor inventory by item ID\n\n[h3]Changes to template projects[/h3]\n● Added <Button_HoverImage_Transition> element plugin\n● Upgraded <MovementPath> plugin to show scene obstacles\n● Removed <XBoxController> plugin and replaced it with gamepad events\n\n● Modified:\nAssets\\Events\\Special Events\\Game initialization.event\nAssets\\Events\\Player Controllers\\Control - update movement dir.event\nAssets\\Events\\Player Controllers\\Control - key down.event\nAssets\\Events\\Player Controllers\\Control - key up.event\nAssets\\Events\\Player Controllers\\Control - mouse down.event\nAssets\\UI\\Title Screen\\Title Screen.ui\nAssets\\UI\\Save & Load\\Save & Load.ui\nAssets\\UI\\Dialog Box\\Dialog Box.ui\nAssets\\UI\\Trading\\Trading Interface.ui\nAssets\\UI\\Menu\\Menu.ui\nAssets\\UI\\Menu\\Get State Info.event\nAssets\\UI\\Menu\\Set Quality Color.event\nAssets\\UI\\Menu\\Drag-and-drop - Mouseup.event\n\n● Added:\nAssets\\Events\\Player Controllers\\Gamepad\\XBoxController - button press.event\nAssets\\Events\\Player Controllers\\Gamepad\\XBoxController - button release.event\nAssets\\Events\\Player Controllers\\Gamepad\\XBoxController - left stick change.event\nAssets\\Events\\Player Controllers\\Gamepad\\XBoxController - right stick change.event\nAssets\\Plugins\\UI Elements\\Button_HoverImage_Transition.js\nAssets\\UI\\!Assets\\Button_Selected.png\n\n● Removed:\nAssets\\UI\\Save & Load\\Save & Load - Keydown.event\nAssets\\UI\\Dialog Box\\Dialog Box - keydown.event\nAssets\\UI\\Trading\\Trading Interface - Keydown.event\nAssets\\UI\\Trading\\Trading Interface - Select Box - Add.event\nAssets\\UI\\Trading\\Trading Interface - Select Box - Remove.event\nAssets\\UI\\Menu\\Menu - Keydown.event\nAssets\\UI\\Menu\\Menu - Select Box - Add.event\nAssets\\UI\\Menu\\Menu - Select Box - Remove.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController.js\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - button press.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - button release.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - button change.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - update movement dir.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - right stick change.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - autorun.event\nAssets\\Plugins\\Global Plugins\\XboxController\\XBoxController - left stick change.event","feedlabel":"Community Announcements","date":1679544400,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5059268543352820712","title":"2/22 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5059268543352820712","is_external_url":true,"author":"yami","contents":"[h3]New Editor Document (English/Chinese)[/h3]\n● Open via \"Help -> Documentation\"\n\n[h3]Adjustment[/h3]\n● If the system scaling is not 100%, the window will be automatically resized when starting the game in windowed mode\n\n[h3]Fix bugs:[/h3]\n● For some AMD graphics cards, the mouse movement is reversed when starting the game in full screen, and even the computer crashes.\n● When calling <Load Scene> command, there may be an error if \"Transfer Player\" is not selected.\n● Textbox elements can be typed even if they are hidden\n● Layout may be miscalculated when a window element is nested with another window element","feedlabel":"Community Announcements","date":1677061623,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5035622743880379968","title":"2/2 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5035622743880379968","is_external_url":true,"author":"yami","contents":"[h3]New Features[/h3]\n● New event themes, commands are now easier to read\n● Add event command folding feature\n● Add \"Actor Text Display\" plugin to the template projects\n- Specify an actor attribute, when the attribute is set to a string, it will be rendered to the screen.\n● Hold ctrl + left click and drag while selecting a scene actor to move it at 0.5 unit distance intervals\n● When the editor exports the asset file, remove the ID from the file name\n\n[h3]Command Changes[/h3]\n● Add Scene -> Shake Screen\n- Selectable random, horizontal and vertical modes\n● Extend Actor->Move Actor->Navigate - Bypass Actors\n- Bypass the actors in the scene when pathfinding (the smaller the actor collision size, the better)\n● Extend Actor->Follow Actor->\"Bypass Actors\" Option\n● Extend Flow->If->Other->Game is paused / Game is not paused\n\n[h3]Fix Bugs[/h3]\n● Command Variable->Set Number->Math->Distance\n- If you input two coordinate points, it always returns 0\n● Command Variable->Set List->Set Number/String List\n- If the list item is removed, the initial value of the list will be changed permanently.\n\n● Modified the following events in the template projects:\nAssets/Skills/!Add skill attrs\nAssets/Skills/!Remove skill attrs\nAssets/States/!Add State Attrs\nAssets/States/!Remove State Attrs\nAssets/Equipments/!Add Equip Attrs\nAssets/Equipments/!Remove Equip Attrs\n\n- Implemented to update the actor's movement speed when the custom attribute \"movement speed\" is changed\n\n[h3]Basic manual is being written...[/h3]","feedlabel":"Community Announcements","date":1675353626,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5035621474414507685","title":"1/20 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5035621474414507685","is_external_url":true,"author":"yami","contents":"Upgrade \"Health Bar\" plugin to add an automatic display mode\n- Show health bar for a period of time after the actor takes damage\n\nUpgrade \"Actor Light System\" plugin\n- Can set different light colors for the actor\n\nAdd \"Trigger - Point Light\" plugin to default templates\n- Render a point light at the location of the trigger\n\nAdd \"Create Temp Point Light\" custom command to default templates\n- Create a light source that is automatically destroyed after a certain period of time at a specified location.\n\nUpgrade template projects to optimize nighttime combat effects\n- You can switch between day/night in the lower right corner\n\nAdd plugin parameter: @actor-getter\nAdd plugin parameter: @position-getter\nAdd Actor.priority property (affects the drawing order of the actor animation)\n\nImprove Project Settings->Actor->Party Inventory Mode->Share the player's inventory\n- Actors that join the player's party midway will automatically share the player's inventory and regain their own inventory when they leave the party\n\nCommand changes:\nExtend Variable->Set Number->Other->Number of actors in the scene\nExtend Inventory->Set Inventory->Restore Inventory (let the actor use his own inventory)","feedlabel":"Community Announcements","date":1674217602,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5035621474406053715","title":"1/18 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5035621474406053715","is_external_url":true,"author":"yami","contents":"Add sound layer for animation\nAdd \"Actor Light System\" plugin to templates, disabled by default\n- Set the light radius and the actor will glow, similar to Diablo\n\nCommand changes:\nAdd Skill->Set Trigger Duration\nAdd Skill->Set Trigger Motion\nExtend Variable->Set Boolean->Script\nExtend Variable->Set Value->Script\nExtend Variable->Set String->Script\nExpand Flow->If->Actor->Check Team Relationship\n- Is a teammate of actor ...\n- Is a friend of actor ...\n- Is an enemy of actor ...\n- Is a member of team ...\n- Is a friend of team ...\n- Is an enemy of team ...\n\nModify Message->Show Choices, remove the limit of the number of choices\n- If the project is an event UI template, note that the events of the dialog box need to be modified to show more than 4 choices. Steps to modify:\n- Copy the new project's Dialog Box(UI File)->InnerOptionWindow -> LoadData event, overwrite the event in the same position in the old project\n- Copy the new project's Dialog Box(UI File)->Option->Click event, overwrite the event in the same position in the old project\n\nModify Variable->Set String->Other->Show Choices - Content, index can be used\nModify Flow->Set Event->Go to Choice Branch, index can be used\n\nMethod name changes for object script:\nonAdd is modified to onScriptAdd\nonRemove is modified to onScriptRemove","feedlabel":"Community Announcements","date":1674017239,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5035620840527327846","title":"1/11 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5035620840527327846","is_external_url":true,"author":"yami","contents":"Event command changes:\nAdd Flow->Transition\nAdd Scene -> Set Terrain\nAdd Actor->Get multiple actors\n\nChange the color of the \"Label\" command to the more distinguishable purple\nExpand Equipment Getter->By ID\nExtend Item Getter->By ID\nModify ItemGetter->The Latest Item\n- When the number of items increases, you can get the item instance through it\nAdd Region Getter\nExtend PositionGetter->Region\n- You can get the random position in the region\n\nAdd File Browser->Select searched file->Context menu->Open file location\n\nFix bugs:\nWrong rendering range of tile map\nThe rotation angle of the region light source is not the same as in the editor","feedlabel":"Community Announcements","date":1673441043,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5035620387694513705","title":"1/7 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5035620387694513705","is_external_url":true,"author":"yami","contents":"Add ARPG event UI template\n\nCommand changes:\nAdd UI->Set Pointer Event Root\n- Used to limit the valid range of UI pointer events\nAdd Actor->Remove Target\n- Removes a specified actor from the pool of actor targets\nAdd System->Pause Game\nAdd System->Continue Game\nAdd System->Prevent Scene Input Events\n- Pause to trigger global mouse events\nAdd System->Restore Scene Input Events\n- Restore global mouse events\nAdd System->Game Data\n- Used to save, load and delete save data.\nExtend Flow->For Each->Save Data\n- Get the index and saved local variables of each save data\n- This option is a bit special, you can get multiple variables\nExtend UI->Set Text->Content, variables can be used\nExtend UI->Set Dialog Box->Content, variables can be used\nExtend UI->Load Image->Shortcut\nExtends UI->Load Image->Base64 Image\n- Loads an image from a base64 image string to an element\nExtend Actor->Change Actor Equipment->Slot, variables can be used\nExtend Flow->Set Number->Other->Get Timestamp\n- Get the current timestamp of the device\nExtend Flow->Set String->Attribute Key\nExtend Flow->Set String->Template String\n- Can insert variables\nExtend Flow->Set String->Other->Parse Timestamp\n- Parse timestamp to a specific date format\nExtend Flow->Set String->Other->Screenshot(base64)\n- Convert the current game screen to a base64 string and save it to a variable\nExtend Flow->Set String->Object->Actor - Team ID\nExtend Flow->Set List->Split String\n- You can split \"a,b,c,d\" into 4 pieces after specifying the separator.\nExtend Flow->Set List->Get Actor Targets\nExtend Flow->If->Actor->Has skill shortcut\nExtend Flow->If->Actor->Has item shortcut\nExtend Actor->Get Actor->Condition, Exclusion\nExtend Equipment Getter->Slot, variables can be used\n\nAdjustment:\nAdjust shortcut key, press [Space] key to drag UI, animation, particle stage\nChange animation playback to [Enter] key\n\nFix bugs:\nCommand: If->Actor is in the screen, it does not take effect\nThe copied element ID is duplicated after cut->undo->paste of UI elements\nThe IDs of variables, properties and enumerations may be duplicated when they are copied across projects\n\n\n\n\nThe UI will be upgraded again and next time will support mouse, keyboard, gamepad and touch screen.\n\nSteps for porting event UI:\n\nFirst, back up your project !!!\n\nDelete YAMI_UI custom command (F10)\nDelete Assets\\ plugins\\YAMI_UI folder\nDelete Assets\\UI\nDelete Assets\\Events\\Special Events\\Show text\nDelete Assets\\Events\\Special Events\\Show choices\n\nOpen the explorer\nCopy \"Assets\\UI\" to the old project\n\nOpen another editor application\nSteam Library -> Yami RPG Editor -> Context Menu -> Manage -> Browse local files -> yami.exe\nCopy \"Global Variables(F3)->UI\\...(all)\" to the old project\nCopy \"Object Attributes(F6)->Element\\...(all)\" to the same location of the old project\nCopy \"Object Attributes(F6)->Skill\\Passive\" to the same location of the old project\nCopy \"Enumeration(F7)->Element Events\\...(all)\" to the same location of the old project\n\nDelete the previous YAMI_UI interface command,\nchange them to\nCall Event: Switch Menu Interface / Open Trading Interface\n\nPress F12 to see if there is a file ID conflict (yellow warning text),\nif there is, find the file with the corresponding ID in the explorer and delete it.","feedlabel":"Community Announcements","date":1673083158,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5000716037469500390","title":"12/29 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5000716037469500390","is_external_url":true,"author":"yami","contents":"Add New Project->Template->Minimized Current Project\n- Export the most simplified open project, discard unused files\nAdd File Browser->Context Menu->Cut\nAdd \"Set Number\" command->Object->Actor - Shortcut Version\n- It increments when the actor's shortcut bar changes\nAdd \"Set Number\" command->Other->Party Version\n- It increments when the party members change\nAdd \"Set List\" command->Get Attribute Names\nAdd \"Set List\" command->Get Attribute Keys\nAdd \"Set List\" command->Get Enum Names\nAdd \"Set List\" command->Get Enum Values\nAdd \"For Each\" command->Attribute Key\nAdd \"For Each\" command->Enum Value\nAdd \"Switch\" command->Attribute Key\nAdd Element Getter window->Get Parent Element\nExpand Skill Getter window->Shortcut Key, can use a variable\nExpand Item Getter window->Shortcut Key, can use a variable\nExpand Variable Getter window->Attribute Key, can use a variable\nAdjust the height of the Attribute window->\"Note\" input box","feedlabel":"Community Announcements","date":1672357567,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5000716037455854573","title":"12/26 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5000716037455854573","is_external_url":true,"author":"yami","contents":"Add the \"XBox Controller\" plugin to the template project, disabled by default.\nAdd the \"Gamepad Vibration\" custom command to the template project.","feedlabel":"Community Announcements","date":1672033961,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5000716037453074652","title":"12/25 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5000716037453074652","is_external_url":true,"author":"yami","contents":"New event command: \"Get Actor\".\n- It can be used to get an actor at the specified location in the scene.\nAdd Window->Project Settings->Text->\"Word Wrap\" parameter\n- Word Wrap = Break Word (For Chinese, Japanese, Korean.)\n- Word Wrap = Keep Word (For English, etc.)\nAdd \"Position of Mouse\" option to the \"Position Getter\" window","feedlabel":"Community Announcements","date":1671968030,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5000716037441349221","title":"12/22 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5000716037441349221","is_external_url":true,"author":"yami","contents":"Add the ability to drag and drop actor, animation and particle files to the scene\nAdd the ability to drag and drop files to the input box\nAdd the ability to drag and drop script files to the script list\nAdd the \"Play\" option in the context menu when selecting a sound file\nAdd \"Copy as Text\" option to the event command list menu\nAdd \"Copy\" and \"Paste\" options to the file browser menu\nAdd \"Scale\" property to the actor file\nActor's \"Scale\" property affects the collision size\nActor's \"Scale\" property affects animation components\nFix the bug that the \"Call Event\" command cannot call built-in events.\nFix the bug that optional script parameters may not be displayed.","feedlabel":"Community Announcements","date":1671690079,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5623338145763573272","title":"12/19 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5623338145763573272","is_external_url":true,"author":"yami","contents":"Remove the limit on the number of simultaneous sound effects. (sounds are no longer lost)\nNow you can refresh the game via F5 when running the game in debug mode.\nModify the behavior of \"Set Element\" -> \"Skip Pointer Events\". (now the element no longer blocks the pointer events of the elements below it)\nFix the bug of resource loading failure caused by case sensitive when deploying to Android and Linux web servers.\nFix the bug that may be stuck in the loading screen when deploying to some servers.","feedlabel":"Community Announcements","date":1671414009,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]},{"gid":"5623338145759436208","title":"12/18 Update","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5623338145759436208","is_external_url":true,"author":"yami","contents":"Upgrade \"Add Animation Component\" command.\n- Added \"Offset Y\" parameter\nFix the bug that an error is reported if there is a text box element when \"Delete Element\"->\"Delete All\".\nFix the bug that \"Set Inventory\"->\"Decrease Items\" cannot reduce the number of the first item.\nModify the behavior of \"Set animation component\"->\"Set sprite\"=NONE, from restoring the default sprite image to setting an empty sprite image. Keep the same behavior as setting actor sprites","feedlabel":"Community Announcements","date":1671315891,"feedname":"steam_community_announcements","feed_type":1,"appid":1964480,"tags":["patchnotes"]}],"count":26}